Public Member Functions | Public Attributes | List of all members
API_ClassificationItem Struct Reference
Classification Manager
Specifies a classification item. More...
#include <APIdefs_Environment.h>
 Public Member Functions
API_ClassificationItem ()
 Public Attributes
API_Guid  | guid
The Archicad generated unique identifier of the classification item.
GS::UniString  | id
The user specified unique identifier for the classification item.
GS::UniString  | name
The display name of the classification item.
GS::UniString  | description
The description of the classification item.
Detailed Description
Specifies a classification item.
Constructor & Destructor Documentation
◆ API_ClassificationItem()
 API_ClassificationItem::API_ClassificationItem  |  ( |   | )
inline
Member Data Documentation
◆ description
 API_ClassificationItem::description
The description of the classification item.
◆ guid
 API_ClassificationItem::guid
The Archicad generated unique identifier of the classification item.
◆ id
 API_ClassificationItem::id
The user specified unique identifier for the classification item.
◆ name
 API_ClassificationItem::name
The display name of the classification item.